In [155]:
# Dependencies
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import string

In [184]:
# Read the csv files
city_data = pd.read_csv("raw_data/city_data.csv")
ride_data = pd.read_csv("raw_data/ride_data.csv")
city_data.head()
# x = city_data.loc[city_data['city'] == 'Port James']
# x

           city  driver_count      type
84   Port James            15  Suburban
100  Port James             3  Suburban

In [186]:
# Check for NAN values and replace with 0
city_data.fillna(value=0)
city_data.head()
#len(city_data)
xyz= city_data[["city", "driver_count"]].set_index("city")
# xyz.head()
repeat = xyz.loc[["Port James"]]
repeat1 = xyz.groupby(["city"])
repeat2 = pd.DataFrame(repeat1['driver_count'].sum())
repeat2.loc['Port James']

repeat2.head()
len(repeat2)

125

In [158]:
ride_data.fillna(value=0)
ride_data.head()

          city                 date   fare        ride_id
0     Sarabury  2016-01-16 13:49:27  38.35  5403689035038
1    South Roy  2016-01-02 18:42:34  17.49  4036272335942
2  Wiseborough  2016-01-21 17:35:29  44.18  3645042422587
3  Spencertown  2016-07-31 14:53:22   6.87  2242596575892
4   Nguyenbury  2016-07-09 04:42:44   6.28  1543057793673

In [159]:
# Merge both the DFs into one
cityride_df = city_data.merge(ride_data, how="inner", on="city")
cityride_df = cityride_df[["date", "city", "type", "driver_count", "fare", "ride_id"]]
cityride_df.head()
#len(cityride_df)

                  date        city   type  driver_count   fare        ride_id
0  2016-08-19 04:27:52  Kelseyland  Urban            63   5.51  6246006544795
1  2016-04-17 06:59:50  Kelseyland  Urban            63   5.54  7466473222333
2  2016-05-04 15:06:07  Kelseyland  Urban            63  30.54  2140501382736
3  2016-01-25 20:44:56  Kelseyland  Urban            63  12.08  1896987891309
4  2016-08-09 18:19:47  Kelseyland  Urban            63  17.91  8784212854829

### PYBER ANALYSIS

In [190]:
# Groupby on city
cityride_grouped_df = cityride_df.groupby(["city"])

# Average fare per city by using groupby object
average_fare = cityride_grouped_df["fare"].mean()

# Total number of rides per city
total_rides_city = cityride_grouped_df["ride_id"].count()
# Total number of driver per city
#total_driver_city = str(cityride_grouped_df["driver_count"].unique()[0]).strip('[]')
#cityride_df(["city", "driver_count"])
#total_driver_city = total_driver_city.map("%s".join)
#total_driver_city_df = 

# final = [{"Rides per City" : average_fare}]
# final_df = pd.DataFrame(final)
#total_driver_city.str.replace("[","")

# for x in total_driver_city:
#     x = str(x).strip("[")
#     print(x)
#     y = x.strip("]")
#     print(y)
# for x in total_driver_city:
#     x = str(x).strip("[]")
#     #print(x)
   
    

#average_fare
#total_rides_city
#total_driver_city_df
#total_rides_city
# final_df

125

In [161]:
#cityride_df = cityride_df.loc[cityride_df["city"] == "East Erin",:]
#cityride_df["driver_count"].unique()
#cityride_df